app/controllers/activites_controller.rb

    def set_activite
      @activite = Activite.find(params[:id])
---
SELECT  "activites".* FROM "activites" WHERE "activites"."id" = ? LIMIT 1  [["id", 1]]